{"text": "GENIE : So what'll it be, master?"}
{"text": "ALADDIN : You're gonna grant me any three wishes I want?"}
{"text": "GENIE : (As William F. Buckley) Ah, almost.  There are a few provisos, a couple of quid pro quos"}
{"text": "ALADDIN : Like?"}
{"text": "GENIE : Ah, rule number one: I can't kill anybody.  (He slices his head off with his finger.)  So don't ask.  Rule two: I can't make anyone fall in love with anyone else.  (Head turns into a big pair of lips which kiss ALADDIN.)  You little punim, there."}
{"text": "ALADDIN : (Looks at ABU as if plotting) Ah, provisos?  You mean limitations?  On wishes? (To ABU) Some all powerful genie--can't even bring people back from the dead. I don't know, Abu--he probably can't even get us out of this cave.  Looks like we're gonna have to find a way out of here-- "}
{"text": "GENIE : Excuse me?  Are you lookin' at me?  Did you rub my lamp? Did you wake me up, did you bring me here?  And all of a sudden, you're walkin' out on me?  (Gets madder and madder) I don't think so, not right now.  You're gettin' your wishes, so siddown!  (They all get on CARPET. GENIE takes the form of a stewardess, with lots of arms pointing out the exits.)  In case of emergency, the exits are here, here, here, here,here, here, here, here, here, here, here, here, anywhere!  Keep your hands and arms inside the carpet.  Weeee'rrrrrreee...outta here! "}
{"text": "SULTAN : Jafar, this is an outrage.  If it weren't for all your years of loyal service... . From now on, you are to discuss sentencing of prisoners with me, before they are beheaded."}
{"text": "GENIE : (Still as stewardess) Thank you for choosing Magic Carpet for all your travel needs.  Don't stand until the rug has come to a complete stop.  (As ALADDIN and ABU get off down the stairway formed by CARPET) Thank you.  Good bye, good bye!  Thank you! Good bye!  (Back to normal)  Well, now.  How about that, Mr.  doubting mustafa?"}
{"text": "ALADDIN : Oh, you sure showed me.  Now about my three wishes-"}
{"text": "GENIE : Dost mine ears deceive me?  Three? You are down by ONE, boy!"}
{"text": "ALADDIN : Ah, no--I never actually wished to get out of the cave.  You did that on your own. "}
{"text": "GENIE : Well, don't I feel just sheepish?  All right, you baaaaad boy,  but no more freebies."}
{"text": "ALADDIN : Fair deal.  So, three wishes.  I want them to be good.  (To GENIE) What would you wish for? "}
{"text": "GENIE : Me?  No one's ever asked me that before. Well, in my case, ah, forget it."}
{"text": "ALADDIN : What?  No, tell me."}
{"text": "GENIE : Freedom."}
{"text": "ALADDIN : You're a prisoner?"}
{"text": "GENIE : It's all part-and-parcel, the whole genie gig."}
{"text": "ALADDIN : Genie, that's terrible."}
{"text": "GENIE : (Comes out of the LAMP) But, oh--to be free.  Not have to go \"Poof! What do you need? Poof! What do you need? Poof! What do you need?\"  To be my own master, such a thing would be greater than all the magic and all the treasures in all  the world! But what am I talking about, here?  Let's get real here.  It's not gonna happen.  Genie, wake up and smell the hummus"}
{"text": "ALADDIN : Why not?"}
{"text": "GENIE : The only way I get outta this is if my master wishes me out.  So you can guess how often that's happened."}
{"text": "ALADDIN : I'll do it. I'll set you free."}
{"text": "GENIE : (Head turns into Pinocchio's with a long nose) Uh huh, right.  Whoop!"}
{"text": "ALADDIN : No, really, I promise.  (He pushes the nose back in and GENIE's head returns to normal.) After make my first two wishes, I'll use my third wish to set you free.   (He holds out his hand)"}
{"text": "GENIE : Well, here's hopin'.  (Shakes ALADDIN's hand.) O.K.   Let's make some magic!  (Turns into a magician.)  So how 'bout it.  What is it you want most?"}
{"text": "ALADDIN : Well, there's this girl--"}
{"text": "GENIE : Eehhh! (Like a buzzer, and GENIE's chest shows a heart with a cross through it.)  Wrong!  I can't make anybody fall in love, remember?"}
{"text": "ALADDIN : Oh, but Genie.  She's smart and fun and..."}
{"text": "GENIE : Pretty?"}
{"text": "ALADDIN : Beautiful.  She's got these eyes that just...and this hair, wow...and her smile."}
{"text": "GENIE : (Sitting in a Parisian cafe with ABU and CARPET.) Ami.  C'est l'amour."}
{"text": "ALADDIN : But she's the princess.  To even have a chance, I'd have to be a--hey, can you make me a prince?"}
{"text": "GENIE : Let's see here.  (Has a \"Royal Cookbook\".) Uh, chicken a'la king? (Pulls out a chicken with a crown on its head)  Nope.  Alaskan king crab?"}
{"text": "ALADDIN : Genie, I wish for you to make me a prince!"}
{"text": "GENIE : All right!  Woof woof woof woof! (Takes on square shoulders and looks like Arsenio Hall. Then becomes a tailor/fashion designer.)  First, that fez and vest combo is much too third century. These patches--what are we trying to say--beggar?  No! Let's work with me here. (He takes ALADDIN's measurements, snaps his fingers and ALADDIN is outfitted in his prince costume.)  I like it, muy macho!  Now, still needs something.  What does it say to me?  It says mode of transportation.  Excuse me, monkey boy!  Aqui, over here!  (ABU tries to cover himself with CARPET, but GENIE zaps him and he flies over.)"}
{"text": "ABU : Uh oh!"}
{"text": "GENIE : Here he comes, (ALADDIN and GENIE are on a game show set, where ALADDIN stands behind a podium with \"AL\" on it.)  And what better way to make your grand entrance on the streets of Agrabah, than riding your very own brand new camel!  Watch out, it spits!  (A door bearing the GENIE's head on it opens, where ABU is transformed into a camel.  He spits out the side of his mouth on cue.  But the GENIE's not sure.)  Mmm, not enough.  (He snaps his fingers and ABU turns into a fancy white horse.) Still not enough.  Let's see.  What do you need?"}
{"text": "ALADDIN : Abu, you look good."}
{"text": "GENIE : He's got the outfit, he's got the elephant, but we're not through yet.  Hang on to your turban, kid, cause we're gonna make you a star! "}
{"text": "JAFAR : Sire, I have found a solution to the problem with your daughter."}
{"text": "GENIE : (GENIE is off screen, a giant balloon gorilla proceeds down the parade) When it comes to exotic type mammals Has he got a zoo, I'm telling you It's a world class menagerie! "}
{"text": "CHORUS : He's got ninety-five white Persian monkeys!"}
{"text": "GENIE : Prince Ali! Amorous he!  Ali Ababwa Heard your princess was a sight lovely to see! And that,good people, is why He got dolled up and dropped by With sixty elephants, llamas galore With his bears and lions A brass band and more With his forty fakirs, his cooks, his bakers His birds that warble on key Make way for Prince Ali! "}
{"text": "SULTAN : (Clapping) Splendid, absolutely marvelous."}
{"text": "GENIE : (to carpet, playing chess) So move!  (CARPET does, knocking a black piece off the board.)  Hey. That's a good move.  (As Rodney Dangerfield) I can't believe it--I'm losing to a rug."}
{"text": "ALADDIN : Genie, I need help."}
{"text": "GENIE : (as Jack Nicholson) All right, sparky, here's the deal.  You wanna court the little lady, you gotta be a straight shooter, do ya follow me?"}
{"text": "ALADDIN : What?"}
{"text": "GENIE : (Back to normal, wearing a mortarboard. He points out his words on a blackboard)  Tell her the...TRUTH!!!"}
{"text": "ALADDIN : No way!  If Jasmine found out I was really some crummy street rat, she'd laugh at me. (He puts on his turban, which lights up as the GENIE.)"}
{"text": "GENIE : A woman appreciates a man who can make her laugh!"}
{"text": "ALADDIN : Hey, that's the last thing I want to  be.  Okay, I'm gonna go see her.  I gotta be smooth, cool, confident.  How do I look?"}
{"text": "GENIE : (Sadly) Like a prince. "}
{"text": "ALADDIN : (From a distance) Princess Jasmine? "}
{"text": "GENIE : How's our beau doing? "}
{"text": "ALADDIN : Good kitty, take off.  Down kitty. (He takes off his turban to brush RAJAH away.)"}
{"text": "GENIE : Never fails.  Get in the bath and there's a rub at the lamp.  (Squeaks the duck)  Hello.  (Sees unconscious ALADDIN) Al?  Al!  Kid, snap out of it! You can't cheat on this one!  I can't help you unless you make a wish.  You have to say  \"Genie I want you to save my life.\"  Got it?  Okay.  C'mon Aladdin!!  (He grabs ALADDIN by the shoulders and shakes him.  His head goes up, then falls.)  I'll take that as a yes.  (Head turns into a siren.) Wooga!  Wooga!  (Turns into a submarine.)  Up scope!  (He babbles in something that sounds like German.  On the surface, a giant water spout emerges, and lands on top of the cliff.  ALADDIN reawakes and coughs the water out of his lungs.) Don't you scare me like that!"}
{"text": "ALADDIN : Genie, I--uh, I-uh...(He can't think of how to say it, so they just hug each other.)  Thanks, Genie."}
{"text": "GENIE : Oh, Al.  I'm gettin' kind of fond of you, kid.  Not that I want to pick out curtains or anything. "}
{"text": "SULTAN : Jasmine!"}
{"text": "GENIE : Huzzah!  Hail the conquering hero!  (Turns into a one-man band.  He sees ALADDIN walk away with his head hung.  He stops, scratches his head, comes up with an idea, then zooms over to ALADDIN.  He holds up his hands like a director scoping a picture and we look through them.)  Aladdin, you've just won the heart of the princess.  What are you gonna do next?  (ALADDIN looks at him, then walks away in sadness to the bed, where he falls on it and sighs. GENIE again is confused, then goes to him and pulls out a script labeled \"Aladdin.\" Whispering: ) Psst, your line is \"I'm going to free the genie.\" Anytime."}
{"text": "ALADDIN : Genie...I can't."}
{"text": "GENIE : Sure you can.  You just go \"Genie, I wish you free.\"  (He grabs ALADDIN's head and uses him as a mock ventriloquist's dummy.  ALADDIN pulls away.)"}
{"text": "ALADDIN : I'm serious.  Look, I'm sorry--I really am. But they want to make me sultan--no!, They want to make Prince Ali sultan.  Without you, I'm just Aladdin."}
{"text": "GENIE : Al, you won!"}
{"text": "ALADDIN : Because of you!  The only reason anyone thinks I'm anything is because of you.  What if they find out I'm not really a prince?  (Quietly)  What if Jasmine finds out?  I'll lose her.  Genie, I can't keep this up on my own.  I can't wish you free."}
{"text": "GENIE : (Sarcastically) Hey, I understand.  After all, you've lied to everyone else.  Hey, I was beginning to feel left out.  Now, if you'll excuse me, master. (He says the last word in disgust, then poofs back into the lamp.) "}
{"text": "ABU : Ohhh."}
{"text": "GENIE : You know Al, I'm getting (turns and sees JAFAR) reallyyyyyy--I don't think you're him.  (He descends and consults a playbill.)  Tonight, the role of Al will be played by a tall, dark and sinister ugly man."}
{"text": "JAFAR : I am your master now.  (He throws GENIE to the ground and puts his foot on GENIE's face.)"}
{"text": "GENIE : I was afraid of that."}
{"text": "JAFAR : Genie, grant me my first wish.  I wish to rule on high, as sultan!!! "}
{"text": "GENIE : Sorry, kid--I got a new master now.  (He places the palace on top of a mountain.)"}
{"text": "SULTAN : Jafar, I order you to stop!"}
{"text": "GENIE : (Again as Buckley) Ah, master-- there are a few addendas, some quid pro quo-"}
{"text": "JAFAR : Don't talk back to me, you stupid blue lout!  You will do what I order you to do, slave! "}
{"text": "GENIE : Al!  Al, little buddy!"}
{"text": "ALADDIN : Shh!"}
{"text": "GENIE : (Literally zips his mouth shut, then unzips it.) Al, I can't help you--I work for senor psychopath, now.  (His head turns into JAFAR's, then back.)"}
{"text": "ALADDIN : Hey--I'm a street rat, remember? (He rezips GENIE's mouth.)  I'll improvise. "}
{"text": "GENIE : Rickem, rockem, rackem, rake--stick that sword into that snake!"}
{"text": "JAFAR : You stay out of thissss! "}
{"text": "GENIE : (Weakly) Jafar, Jafar, he's our man--if he can't do it, GREAT! "}
{"text": "JASMINE : Aladdin! "}
{"text": "GENIE : Al, what are you doing?  Why are you bringing me into this?"}
{"text": "ALADDIN : Face it, Jafar--you're still just second best!"}
{"text": "GENIE : The boy is crazy.  He's a little punch drunk.  One too many hits with the snake  (His hand turns into a snake and he hits his head with it.)"}
{"text": "JAFAR : Slave, I make my third wish!  I wish to be an all powerful genie!"}
{"text": "GENIE : (Reluctantly) All right, your wish is my command. Way to go, Al. "}
{"text": "JAFAR : Yes!  Yes!  The power! The absolute power!"}
{"text": "GENIE : Al, you little genius, you! "}
{"text": "JAFAR : (Both from inside the lamp.)  Get your blasted beak out of my face!"}
{"text": "GENIE : Allow me.  (He takes the lamp and goes to the balcony.  He is now wearing a baseball cap.  He winds up as if to throw the lamp, but opens his palm flat and flicks it out into the desert with his finger.) Ten- thousand years in a cave of wonders ought to chill him out! "}
{"text": "ALADDIN : Jasmine, I'm sorry I lied to you about being a prince."}
{"text": "GENIE : (Wipes away a tear)  Al, no problem. You've still got one wish left.  Just say the word and you're a prince again."}
{"text": "ALADDIN : But Genie, what about your freedom?"}
{"text": "GENIE : Hey, it's only an eternity of servitude.  This is love.  (He leans down next to her.)  Al, you're not gonna find another girl like her in a million years.  Believe me, I know.  I've looked."}
{"text": "ALADDIN : Jasmine, I do love you, but I've got to stop pretending to be something I'm not."}
{"text": "GENIE : One bona fide prince pedigree coming up.  I--what?"}
{"text": "ALADDIN : (He holds the lamp up to GENIE.)  Genie, you're free! "}
{"text": "GENIE : (He can't believe it.)  Heh, heh!  I'm free. I'm free.  (He hands the lamp to ALADDIN.)  Quick, quick, wish for something outrageous.  Say  \"I want the Nile.\"   Wish for the Nile.  Try that!"}
{"text": "ALADDIN : I wish for the Nile."}
{"text": "GENIE : No way!!  (Laughs hysterically.  He bounces around the balcony like a pinball.)  Oh does that feel good!  I'm free!  I'm free at last!  I'm hittin' the road.  I'm off to see the world!  I-- "}
{"text": "ALADDIN : Genie, I'm--I'm gonna miss you."}
{"text": "GENIE : Me too, Al.  No matter what anybody says, you'll always be a prince to me. "}
{"text": "SULTAN : That's right.  You've certainly proven your worth as far as I'm concerned. It's that law that's the problem."}
{"text": "GENIE : Oh, all of ya. Come over here.  Big group hug! Mind if I kiss the monkey?  (He kisses ABU.)  Ooh, hairball!  Well, I can't do any more damage around this popsicle stand.  I'm outta here!  Bye, bye, you two crazy lovebirds.  Hey, Rugman: ciao!  I'm history!   No, I'm mythology!  No, I don't care what I am--I'm free! "}
{"text": "ALADDIN : A whole new world"}
{"text": "GENIE : Made ya look! "}
