{"speaker": "ALADDIN", "text": "THE COMPLETE SCRIPT COMPILED BY BEN SCRIPPS <34RQNPQ@CMUVM.CSV.CMICH.EDU>"}
{"speaker": "PEDDLER", "text": "Oh I come from a land From a faraway place Where the caravan camels roam Where they cut off your ear /Where it's flat and immense If they don't like your face /And the heat is intense It's barbaric, but hey--it's home! When the wind's at your back And the sun's from the west And the sand in the glass is right Come on down, Stop on by Hop a carpet and fly To another Arabian night!  Arabian nights Like Arabian days More often than not Are hotter than hot In a lot of good ways  Arabian nights 'Neath Arabian moons A fool off his guard Could fall and fall hard Out there on the dunes.  Ah, Salaam and good evening to you worthy friend. Please, please, come closer--(Camera zooms in hitting peddler in face) Too close, a little too close.  (Camera zooms back out to CU)There.Welcome to Agrabah.  City of mystery, of enchantment, and the finest merchandise this side of the river Jordan, on sale today, come on down! Heh, heh.  Look at this! Yes!  Combination hookah and coffee maker--also makes Julienne fries.  Will not break"}
{"speaker": "JAFAR", "text": "You...are late."}
{"speaker": "GAZEEM", "text": "A thousand apologies, O patient one."}
{"speaker": "JAFAR", "text": "You have it, then?"}
{"speaker": "GAZEEM", "text": "I had to slit a few throats to get it.  (Pulls out half of the medallion.  JAFAR reaches out for it, but GAZEEM yanks it back.)  Ah, ah, ahhh!  The treasure!"}
{"speaker": "JAFAR", "text": "Trust me, my pungent friend.  You'll get what's coming to you."}
{"speaker": "IAGO", "text": "What's coming to you!  Awk! "}
{"speaker": "JAFAR", "text": "Quickly, follow the trail! "}
{"speaker": "JAFAR", "text": "At last, after all my years of searching,  the cave of wonders!"}
{"speaker": "IAGO", "text": "Awk!  Cave of wonders!"}
{"speaker": "GAZEEM", "text": "By Allah!"}
{"speaker": "JAFAR", "text": "Now, remember!  Bring me the lamp.  The rest of the treasure is yours, but the lamp is mine! "}
{"speaker": "IAGO", "text": "Awk, the lamp!  Awk,  the lamp!  (Now that IAGO and JAFAR are alone, IAGO opens up in normal English.) Jeez, where'd ya dig this bozo up? "}
{"speaker": "CAVE", "text": "Who disturbs my slumber?"}
{"speaker": "GAZEEM", "text": "It is I, Gazeem, a humble thief."}
{"speaker": "CAVE", "text": "Know this.  Only one may enter here.  One whose worth lies far within.  A diamond in the rough. "}
{"speaker": "JAFAR", "text": "What are you waiting for?  Go on! "}
{"speaker": "CAVE", "text": "Seek thee out, the diamond in the rough. "}
{"speaker": "IAGO", "text": "I can't believe it.  I just don't believe it. We're never gonna get a hold of that stupid lamp!  Just forget it.  Look at this.  Look at this.  I'm so ticked off that I'm molting!  (He flies up to JAFAR's shoulder.)"}
{"speaker": "JAFAR", "text": "Patience, Iago.  Patience.  Gazeem was obviously less than worthy."}
{"speaker": "IAGO", "text": "(Extremely sarcastically) Oh, there's a big surprise.  That's an incred--I think I'm gonna have a heart attack and die from not surprise!  What're we gonna do?  We got a big problem here,a big prob-"}
{"speaker": "JAFAR", "text": "Yes, we do.  Only one may enter.  I must find this one, this...diamond in the rough. "}
{"speaker": "GUARD", "text": "Stop, thief!  I'll have your hands for a trophy, street rat!"}
{"speaker": "ALADDIN", "text": "(Looks back, then down, then at the bread.)  All this for a loaf of bread?  GUARD 1:    There he is! GUARD 2:    You won't get away so easy!"}
{"speaker": "ALADDIN", "text": "You think that was easy?  GUARD 1:    You two, over that way, and you, with me.  We'll find him. "}
{"speaker": "ALADDIN", "text": "Morning, ladies. WOMAN 1:    Getting into trouble a little early today, aren't we Aladdin?"}
{"speaker": "ALADDIN", "text": "Trouble?  No way.  You're only in trouble if you get caught-- "}
{"speaker": "ALADDIN", "text": "I'm in trouble!"}
{"speaker": "GUARD", "text": "...and this time--(A screeching sound from ABU, then the guard's turban is pulled down over his eyes.  ABU dances on the GUARD's head, laughing.)"}
{"speaker": "ALADDIN", "text": "Perfect timing, Abu!"}
{"speaker": "ABU", "text": "Hello!"}
{"speaker": "ALADDIN", "text": "Come on, let's get outta here! Gotta keep...one jump ahead of the breadline One swing ahead of the sword I steal only what I can't afford That's everything! "}
{"speaker": "GUARDS", "text": "(one at a time) Riffraff! Street rat! Scoundrel! Take that!"}
{"speaker": "ALADDIN", "text": "Just a little snack, guys! "}
{"speaker": "GUARDS", "text": "Rip him open, take it back guys!"}
{"speaker": "ALADDIN", "text": "I can take a hint, gotta face the facts You're my only friend, Abu!"}
{"speaker": "WOMEN", "text": "Who?!? "}
{"speaker": "WOMAN", "text": "I'd blame parents, except he hasn't got 'em!"}
{"speaker": "ALADDIN", "text": "Gotta eat to live, gotta steal to eat Tell you all about it when I got the time! "}
{"speaker": "CROWD", "text": "Stop, thief! Vandal! Outrage! Scandal!"}
{"speaker": "ALADDIN", "text": "Let's not be too hasty "}
{"speaker": "LADY", "text": "Still I think he's rather tasty "}
{"speaker": "ALADDIN", "text": "Gotta eat to live, gotta steal to eat Otherwise we'd get along!"}
{"speaker": "GUARDS", "text": "WRONG!  GUARD 1:    He's got a sword! GUARD 2:    You idiot--we've ALL got swords!! "}
{"speaker": "ALADDIN", "text": "One jump ahead of the hoofbeats!"}
{"speaker": "CROWD", "text": "Vandal!"}
{"speaker": "ALADDIN", "text": "One hop ahead of the hump!"}
{"speaker": "CROWD", "text": "Street rat!"}
{"speaker": "ALADDIN", "text": "One trick ahead of disaster"}
{"speaker": "CROWD", "text": "Scoundrel!"}
{"speaker": "ALADDIN", "text": "They're quick--but I'm much faster"}
{"speaker": "CROWD", "text": "Take that! "}
{"speaker": "ALADDIN", "text": "Here goes, better throw my hand in Wish me happy landin' All I gotta do is jump! "}
{"speaker": "ALADDIN", "text": "And now, esteemed effendi, we feast!  All right! "}
{"speaker": "ABU", "text": "Uh-oh! "}
{"speaker": "ALADDIN", "text": "Here, go on--take it. "}
{"speaker": "ABU", "text": "Ah, don't.  Huh?  BYSTANDER 1:    On his way to the palace, I suppose. BYSTANDER 2:    Another suitor for the princess. "}
{"speaker": "PRINCE", "text": "Out of my way, you filthy brat! "}
{"speaker": "ALADDIN", "text": "Hey, if I were as rich as you, I could afford some manners"}
{"speaker": "PRINCE", "text": "Oh--I teach you some manners! "}
{"speaker": "ALADDIN", "text": "Look at that, Abu.  It's not every day you see a horse with two rear ends! "}
{"speaker": "PRINCE", "text": "You are a worthless street rat.  You were born a street rat, you'll die a street rat, and only your fleas will mourn you. "}
{"speaker": "ALADDIN", "text": "I'm not worthless.  And I don't have fleas.  Come on, Abu.  Let's go home. "}
{"speaker": "ALADDIN", "text": "Riffraff, street rat. I don't buy that. If only they'd look closer Would they see a poor boy?  No siree. They'd find out, there's so much more to me. "}
{"speaker": "PRINCE", "text": "I've never been so insulted! "}
{"speaker": "SULTAN", "text": "Oh, Prince Achmed.  You're not leaving so soon, are you? "}
{"speaker": "PRINCE", "text": "Good luck marrying her off! "}
{"speaker": "SULTAN", "text": "Oh, Jasmine!  Jasmine!  Jasmine!  (The SULTAN goes off into the garden looking for his daughter.  He finds her, but is interrupted by RAJAH, JASMINE's pet tiger, who blocks him off.  RAJAH has a piece of the PRINCE's undershorts in his mouth.The SULTAN grabs the cloth and yanks it out of RAJAH's mouth.) Confound it, Rajah!  So, this is why Prince Achmed stormed out!"}
{"speaker": "JASMINE", "text": "Oh, father.  Rajah was just playing with him, weren't you Rajah.  (RAJAH comes over and allows JASMINE to pet and hug him.)  You were just playing with that overdressed, self-absorbed Prince Achmed, weren't you?  (She cuddles with RAJAH, enjoying the moment, until she looks up at her angry father. ) Ahem."}
{"speaker": "SULTAN", "text": "Dearest, you've got to stop rejecting every suitor that comes to call.  The law says you..."}
{"speaker": "BOTH", "text": "...must be married to a prince. "}
{"speaker": "SULTAN", "text": "By your next birthday."}
{"speaker": "JASMINE", "text": "The law is wrong."}
{"speaker": "SULTAN", "text": "You've only got three more days!"}
{"speaker": "JASMINE", "text": "Father,  I hate being forced into this.  (She takes a dove out of the cage and pets it.) If I do marry, I want it to be for love."}
{"speaker": "SULTAN", "text": "Jasmine, it's not only this law.  (She hands him the dove, and he puts it back in the cage.) I'm not going to be around forever, and I just want to make sure you're taken care of, provided for."}
{"speaker": "JASMINE", "text": "Try to understand.  I've never done a thing on my own. (She swirls her finger in the water of the pond, petting the fish.)I've never had any real friends. (RAJAH looks up at her and growls.) Except you, Rajah.  (Satisfied, he goes back to sleep.)  I've never even been outside the palace walls."}
{"speaker": "SULTAN", "text": "But Jasmine, you're a princess."}
{"speaker": "JASMINE", "text": "Then maybe I don't want to be a princess.  (She splashes the water.)"}
{"speaker": "SULTAN", "text": "Oooohhh!  Allah forbid you should have any daughters! "}
{"speaker": "SULTAN", "text": "I don't know where she gets it from.  Her mother wasn't nearly so picky.  (A shadow falls over him. He looks up startled and sees JAFAR.)  Ooh, oh. Ah, Jafar--my most trusted advisor.  I am in desperate need of your wisdom."}
{"speaker": "JAFAR", "text": "My life is but to serve you, my lord.  (He bows.)"}
{"speaker": "SULTAN", "text": "It's this suitor business.  Jasmine refuses to choose a husband.  I'm at my wit's-end."}
{"speaker": "IAGO", "text": "(In the parrot voice) Awk!  Wit's-end."}
{"speaker": "SULTAN", "text": "Oh, ha ha.  Have a cracker, pretty polly!  (He pulls a cracker out from his pocket.  IAGO looks terrified.  Then the SULTAN stuffs it in IAGO's mouth.  IAGO grimaces as he tries to eat it.  JAFAR and the SULTAN both laugh.)"}
{"speaker": "JAFAR", "text": "Your majesty certainly has a way with dumb animals."}
{"speaker": "SULTAN", "text": "If anyone can help, it's you."}
{"speaker": "JAFAR", "text": "Ah, but it would require the use of the mystic blue diamond."}
{"speaker": "SULTAN", "text": "Uh, my ring?  But it's been in the family for years."}
{"speaker": "JAFAR", "text": "It is necessary to find the princess a suitor."}
{"speaker": "SULTAN", "text": "Everything...will be...fine."}
{"speaker": "JAFAR", "text": "The diamond."}
{"speaker": "SULTAN", "text": "Here, Jafar. Whatever you need will be fine. "}
{"speaker": "JAFAR", "text": "You are most gracious, my liege.  Now run along and play with your little toys."}
{"speaker": "SULTAN", "text": "(Still hypnotized)  Yes...that'll be...pretty good. "}
{"speaker": "IAGO", "text": "I can't take it anymore!  If I gotta choke down on one more of those moldy, disgusting crackers...bam! Whack! "}
{"speaker": "JAFAR", "text": "Calm yourself, Iago."}
{"speaker": "IAGO", "text": "Then I'd grab him around the head.  Whack! Whack!"}
{"speaker": "JAFAR", "text": "(Speaking over IAGO.)  Soon, I will be sultan, not that addlepated twit."}
{"speaker": "IAGO", "text": "And then I stuff the crackers down his throat!  Ha ha! "}
{"speaker": "JASMINE", "text": "Oh, I'm sorry, Rajah.  But I can't stay here and have my life lived for me.  I'll miss you.(She begins to climb again, and is helped up by RAJAH, who begins to whine and whimper.)  Good bye! "}
{"speaker": "ALADDIN", "text": "Okay, Abu.  Go! "}
{"speaker": "PROPRIETOR", "text": "(To passing crowd)  Try this, your taste buds will dance and sing. (ABU grabs a melon and hangs there, distracting his attention.)  Hey, get your paws off that."}
{"speaker": "ABU", "text": "Blah blah blah!"}
{"speaker": "PROPRIETOR", "text": "Why, you!  Get away from here, you filthy ape! "}
{"speaker": "ABU", "text": "Bye bye! "}
{"speaker": "ALADDIN", "text": "Nice goin' Abu.  Breakfast is served.  SHOPKEEPER 1:   Pretty lady, buy a pot.  No finer pot in brass or silver. SHOPKEEPER 2:   Sugar dates, sugar dates and figs!  Sugar dates and pistachios! SHOPKEEPER 3:   Would the lady like a necklace.  A pretty necklace for a pretty lady.  SHOPKEEPER 4:   Fresh fish!  We catch 'em, you buy 'em!"}
{"speaker": "JASMINE", "text": "I don't think so.  (She backs away, but bumps into a fire eater, who is startled into swallowing his fire.)  Oh, excuse me.  (He gulps, then belches fire from his mouth.  JASMINE is disgusted.  He is pleased and taps his stomach.  ALADDIN sees her, and a strange look comes over his face.)  I'm really very sorry."}
{"speaker": "ALADDIN", "text": "(He's obviously deeply in love with her.)  Wow! "}
{"speaker": "ABU", "text": "Uh oh.  Hello?  Hello? "}
{"speaker": "JASMINE", "text": "Oh, you must be hungry.  Here you go.  (The boy runs off.)"}
{"speaker": "PROPRIETOR", "text": "You'd better be able to pay for that."}
{"speaker": "JASMINE", "text": "(Mystified) Pay?"}
{"speaker": "PROPRIETOR", "text": "No one steals from my cart!"}
{"speaker": "JASMINE", "text": "Oh, I'm sorry sir.  I don't have any money."}
{"speaker": "PROPRIETOR", "text": "Thief!"}
{"speaker": "JASMINE", "text": "Please, if you let me go to the palace, I can get some from the Sultan."}
{"speaker": "PROPRIETOR", "text": "Do you know what the penalty is for stealing? "}
{"speaker": "JASMINE", "text": "No, no please! "}
{"speaker": "ALADDIN", "text": "Thank you kind sir.  I'm so glad you've found her. I've been looking all over for you."}
{"speaker": "JASMINE", "text": "(whispering) What are you doing?"}
{"speaker": "ALADDIN", "text": "(whispering back) Just play along."}
{"speaker": "PROPRIETOR", "text": "You know this girl?"}
{"speaker": "JASMINE", "text": "Sadly, yes.  She is my sister.  She's a little crazy.  (He circles his finger around his ear. She is shocked.  The PROPRIETOR grabs him by the vest.)"}
{"speaker": "PROPRIETOR", "text": "She said she knows the Sultan!"}
{"speaker": "ALADDIN", "text": "She thinks the monkey is the Sultan. "}
{"speaker": "JASMINE", "text": "Oh, wise Sultan.  How may I serve you?"}
{"speaker": "ABU", "text": "Well, blah blah blah blah."}
{"speaker": "ALADDIN", "text": "Tragic, isn't it?  (He leans forward, picking up another apple from the cart with his foot.) But, no harm done.  (Walks over to Jasmine.)  Now come along sis. Time to see the doctor."}
{"speaker": "JASMINE", "text": "(To a camel standing nearby) Oh, hello doctor. How are you?"}
{"speaker": "ALADDIN", "text": "No, no, no. Not that one. (To ABU, whose pockets are bulging.) Come on, Sultan. "}
{"speaker": "PROPRIETOR", "text": "Huh?  What is it?  (ABU picks up what he can carry, and the trio run off.) Come back here, you little thieves! "}
{"speaker": "IAGO", "text": "(huffing and puffing)  With all due respect, your rottenness, couldn't we just wait for a real storm?"}
{"speaker": "JAFAR", "text": "Save your breath, Iago.  Faster!  (He places the SULTAN's ring in the contraption.)"}
{"speaker": "IAGO", "text": "Yes, o mighty evil one. "}
{"speaker": "JAFAR", "text": "Ah, sands of time--reveal to me the one who can enter the cave.  (The sand in top forms the Cave of Wonders.  It falls through into a storm, but it shows ALADDIN climbing up a ladder, followed by JASMINE who is covered in her cloak.) Yes, yes! There he is.  My diamond in the rough!"}
{"speaker": "IAGO", "text": "That's him?!?!   That's the clown we've been waitin' for? (IAGO loses his footing and is sucked into the gears.)"}
{"speaker": "JAFAR", "text": "Let's have the guards extend him an invitation to the palace, shall we? "}
{"speaker": "IAGO", "text": "Swell. "}
{"speaker": "ALADDIN", "text": "Almost there. "}
{"speaker": "JASMINE", "text": "I want to thank you for stopping that man."}
{"speaker": "ALADDIN", "text": "Uh, forget it.  (He grabs a pole.)  So, uh, this is your first time in the marketplace, huh? "}
{"speaker": "JASMINE", "text": "Is it that obvious?"}
{"speaker": "ALADDIN", "text": "Well, you do kinda stand out.  (He stares at her, still in love.  She returns the look.  But he realizes what he is doing, and returns to normal.) I mean, uh, you don't seem to know how dangerous Agrabah can be. (He lays a plank between the buildings for her to walk over, but as he is leaned down, she vaults over his head.  He looks back in surprise.  She tosses the pole to him.  Both ALADDIN's and ABU's eyes bulge.)"}
{"speaker": "JASMINE", "text": "I'm a fast learner."}
{"speaker": "ALADDIN", "text": "Right.  C'mon, this way.  (They go inside the roof of a building, dodging planks and beams as they go.)  Whoa.  Watch your head there.  Be careful."}
{"speaker": "JASMINE", "text": "Is this where you live?"}
{"speaker": "ALADDIN", "text": "Yep.  Just me and Abu.  Come and go as we please."}
{"speaker": "JASMINE", "text": "Fabulous."}
{"speaker": "ALADDIN", "text": "Well, it's not much, (he pulls back the curtain and exposes the palace) but it's got a great view. Palace looks pretty amazing, huh?"}
{"speaker": "JASMINE", "text": "Oh, it's wonderful."}
{"speaker": "ALADDIN", "text": "I wonder what it would be like to live there, to have servants and valets..."}
{"speaker": "JASMINE", "text": "Oh, sure.   People who tell you where to go and how to dress."}
{"speaker": "ALADDIN", "text": "It's better than here.  Always scraping for food and ducking the guards."}
{"speaker": "JASMINE", "text": "You're not free to make your own choices."}
{"speaker": "ALADDIN", "text": "Sometimes you feel so--"}
{"speaker": "JASMINE", "text": "You're just--"}
{"speaker": "BOTH", "text": "(in unison) --trapped. "}
{"speaker": "ALADDIN", "text": "So, where're you from?"}
{"speaker": "JASMINE", "text": "What does it matter?  I ran away, and I am not going back."}
{"speaker": "ALADDIN", "text": "Really?  (He takes a bite from the apple in his hand, then hands it to ABU, who has a disgusted look on his face.)"}
{"speaker": "ABU", "text": "Why you! "}
{"speaker": "JASMINE", "text": "My father's forcing me to get married."}
{"speaker": "ALADDIN", "text": "That's--that's awful.  (ABU appears from behind the princess and tries to steal the apple.) Abu! "}
{"speaker": "JASMINE", "text": "What?"}
{"speaker": "ALADDIN", "text": "Abu says that--uh--that's not fair."}
{"speaker": "ABU", "text": "What?"}
{"speaker": "JASMINE", "text": "Oh did he?"}
{"speaker": "ALADDIN", "text": "Yeah, of course."}
{"speaker": "JASMINE", "text": "And does Abu have anything else to say?"}
{"speaker": "ALADDIN", "text": "Well, uh, he wishes there was something he could do to help."}
{"speaker": "ABU", "text": "Oh, boy!"}
{"speaker": "JASMINE", "text": "Hmm, tell him that's very sweet. "}
{"speaker": "GUARD", "text": "Here you are! ALADDIN and JASMINE:    They've found me!  (To each other) They're after you?"}
{"speaker": "JASMINE", "text": "My father must have sent them--"}
{"speaker": "ALADDIN", "text": "Do you trust me?"}
{"speaker": "JASMINE", "text": "What?"}
{"speaker": "ALADDIN", "text": "Do you trust me? (He extends his hand)"}
{"speaker": "JASMINE", "text": "Yes. (She takes it.)"}
{"speaker": "ALADDIN", "text": "Then jump! "}
{"speaker": "GUARD", "text": "We just keep running into each other, don't we, street rat? "}
{"speaker": "GUARD", "text": "It's the dungeon for you, boy."}
{"speaker": "ALADDIN", "text": "Hey, get off of me!"}
{"speaker": "JASMINE", "text": "Let go of him."}
{"speaker": "GUARD", "text": "(Not realizing she is the princess) Look what we have here, men--a street mouse.  (He throws her down.)"}
{"speaker": "JASMINE", "text": "(standing up and pulling off the hood of her cloak) Unhand him, by order of the princess. "}
{"speaker": "GUARD", "text": "Princess Jasmine."}
{"speaker": "ALADDIN", "text": "The princess?"}
{"speaker": "ABU", "text": "(peeking out from the vase) The princess?"}
{"speaker": "GUARD", "text": "What are you doing outside the palace?  And with this street rat?"}
{"speaker": "JASMINE", "text": "That's not your concern.  Do as I command.  Release him!"}
{"speaker": "GUARD", "text": "Well, I would, princess, but my orders come from Jafar.  You'll have to take it up with him. "}
{"speaker": "JASMINE", "text": "(getting a very pissed-off look) Believe me, I will. "}
{"speaker": "JASMINE", "text": "Jafar?"}
{"speaker": "JAFAR", "text": "Oh, uh, princess."}
{"speaker": "IAGO", "text": "Awk! Jafar, I'm stuck!"}
{"speaker": "JAFAR", "text": "How may I be of service to you? (He spreads out his cape, hiding the door.)"}
{"speaker": "JASMINE", "text": "The guards just took a boy from the market, on your orders."}
{"speaker": "JAFAR", "text": "Your father's charged me with keeping peace in Agrabah.  The boy was a criminal."}
{"speaker": "JASMINE", "text": "What was the crime?"}
{"speaker": "IAGO", "text": "I can't breathe, Jafar!"}
{"speaker": "JAFAR", "text": "Why, kidnapping the princess, of course."}
{"speaker": "IAGO", "text": "If you could just--(JAFAR kicks him back inside the door and it slams shut)--wow, that hurt!"}
{"speaker": "JASMINE", "text": "He didn't kidnap me! I ran away!"}
{"speaker": "JAFAR", "text": "(Walking away as if shocked) Oh, dear!  Oh, why frightfully upsetting.  Had I but known."}
{"speaker": "JASMINE", "text": "What do you mean?"}
{"speaker": "JAFAR", "text": "Sadly, the boy's sentence has already been carried out."}
{"speaker": "JASMINE", "text": "What sentence?"}
{"speaker": "JAFAR", "text": "(with a sinister tone)  Death.  (JASMINE gasps.) By beheading."}
{"speaker": "JASMINE", "text": "No!  (She collapses to the floor.)"}
{"speaker": "JAFAR", "text": "I am exceedingly sorry, princess."}
{"speaker": "JASMINE", "text": "How could you?  (She runs from the room crying.) "}
{"speaker": "IAGO", "text": "So, how did  it go?"}
{"speaker": "JAFAR", "text": "I think she took it rather well.  (They both get a sinister smile on their faces.) "}
{"speaker": "JASMINE", "text": "It's all my fault, Rajah.  I didn't even know his name. "}
{"speaker": "ALADDIN", "text": "(to himself) She was the princess.  I don't believe it.  I must have sounded so stupid to her."}
{"speaker": "ABU", "text": "(from a distance) Yoo-hoo!  Aladdin? Hello! "}
{"speaker": "ALADDIN", "text": "Abu!  Down here!  Hey, c'mon--help me outta these. "}
{"speaker": "ALADDIN", "text": "Hey, she was in trouble.  Ah, she was worth it. "}
{"speaker": "ABU", "text": "Yeah, yeah, yeah."}
{"speaker": "ALADDIN", "text": "Don't worry, Abu.  I'll never see her again.  I'm a street rat, remember, and there's a law. She's gotta marry a prince, she deserves it. "}
{"speaker": "ABU", "text": "Ta da!"}
{"speaker": "ALADDIN", "text": "(Rubbing his wrists) I'm a--I'm a fool OLD MAN:    You're only a fool if you give up, boy. "}
{"speaker": "ALADDIN", "text": "Who are you? OLD MAN:    A lowly prisoner, like yourself.  But together, perhaps we can be more."}
{"speaker": "ALADDIN", "text": "I'm listening. OLD MAN:    There is a cave, boy.  A cave of wonders.  Filled with treasures beyond your wildest dreams. Treasure enough to impress even your princess, I'd wager. "}
{"speaker": "IAGO", "text": "Jafar, can ya hurry it up?  I'm dyin' in here!"}
{"speaker": "ALADDIN", "text": "But the law says that only a prince can marry-- OLD MAN:    You've heard of the golden rule, haven't you boy? Whoever has the gold makes the rules.(He grins, showing a hideously bad mouth.)"}
{"speaker": "ALADDIN", "text": "So why would you share all of this wonderful treasure with me? OLD MAN:    I need a young man with strong legs and a strong back to go in after it."}
{"speaker": "ALADDIN", "text": "Ah, one problem.  It's out there, we're in here?  OLD MAN:    Mmm, mmm, mmm.,  Things aren't always what they seem.  So, do we have a deal? "}
{"speaker": "ABU", "text": "Oh, hmm. "}
{"speaker": "CAVE", "text": "Who disturbs my slumber?"}
{"speaker": "ALADDIN", "text": "It is I, Aladdin."}
{"speaker": "CAVE", "text": "Proceed.  Touch nothing but the lamp.  OLD MAN:    Remember, boy--first fetch me the lamp, and then you shall have your reward."}
{"speaker": "ALADDIN", "text": "C'mon, Abu.  (to ABU hiding under the shoulder of his vest.) "}
{"speaker": "ALADDIN", "text": "Would ya look at that!"}
{"speaker": "ABU", "text": "Uh oh!"}
{"speaker": "ALADDIN", "text": "Just a handful of this stuff would make me richer than the sultan! "}
{"speaker": "ALADDIN", "text": "Abu! "}
{"speaker": "ALADDIN", "text": "Don't...touch...anything!  We gotta find that lamp. "}
{"speaker": "ABU", "text": "Huh? "}
{"speaker": "ABU", "text": "Aladdin!  Aladdin!"}
{"speaker": "ALADDIN", "text": "Abu, will ya knock it off? "}
{"speaker": "ALADDIN", "text": "Abu, what are you--crazy? "}
{"speaker": "ALADDIN", "text": "A magic carpet!  C'mon.  C'mon out.  I'm not gonna hurt you. "}
{"speaker": "ALADDIN", "text": "Take it easy, Abu.  He's not gonna bite. "}
{"speaker": "ALADDIN", "text": "Hey, wait a minute.  Don't go.  Maybe you can help us.  (CARPET looks back, excited. It then flies over and wraps around the pair.)  Hey, whoa!  You see, we're trying to find this lamp.  (CARPET motions for them to follow it.)  I think he knows where it is. "}
{"speaker": "ALADDIN", "text": "Wait here!"}
{"speaker": "ABU", "text": "Oh.  Huh? "}
{"speaker": "ALADDIN", "text": "This is it?  This is what we came all the way down here to--  (He looks down and sees ABU break free of CARPET's hold and lunge toward the jewel.)  Abu- NO!  CAVE VOICE: Infidels!"}
{"speaker": "ABU", "text": "Uh oh! CAVE VOICE: You have touched the forbidden treasure.  (ABU places the jewel back into the paw, but the jewel and the shrine melt into lava.) Now you will never again see the light of day! "}
{"speaker": "ALADDIN", "text": "Whoa!  Carpet, let's move! "}
{"speaker": "ALADDIN", "text": "Abu, this is no time to panic!  (He pulls ABU off his head and sees they are flying into a wall.) Start panicking. "}
{"speaker": "ALADDIN", "text": "Help me out! OLD MAN:    Throw me the lamp!"}
{"speaker": "ALADDIN", "text": "I can't hold on.  Give me your hand. OLD MAN:    First give me the lamp!  OLD MAN:    Ha ha ha ha!  Yes!  At last!  Ha ha ha ha! "}
{"speaker": "ALADDIN", "text": "What are you doing? OLD MAN:    Giving you your reward.  (JAFAR returns to his normal voice.) Your eternal reward. "}
{"speaker": "JAFAR", "text": "Heh heh heh! It's mine.  It's all mine! I (He can't find it in his pocket)--- where is it?  No. NO!! "}
{"speaker": "SULTAN", "text": "Jasmine?  Oh, dearest.  What's wrong?"}
{"speaker": "JASMINE", "text": "Jafar...has...done something... terrible.  (She looks as if she's been crying.)"}
{"speaker": "SULTAN", "text": "There, there, there, my child--we'll set it right. Now, tell me everything. "}
{"speaker": "ABU", "text": "Oh, oh. Aladdin?  Wake up.  Aladdin. "}
{"speaker": "ALADDIN", "text": "Oh, my head. (He looks at the entrance sealed in.) We're trapped.  (Angry, shaking his fists at the entrance) That two faced son-of-a-jackal!  (Calmer) Whoever he was, he's long gone with that lamp."}
{"speaker": "ABU", "text": "Aha! "}
{"speaker": "ALADDIN", "text": "Why, you hairy little thief!  Looks like such a beat-up, worthless piece of junk.  Hey, I think there's something written here, but it's hard to make out. "}
{"speaker": "GENIE", "text": "Aaaaahhhhh!  OY!  Ten-thousand years will give ya such a crick in the neck!  (He hangs ALADDIN on a nearby rock.  Then he pulls his head off and spins it around, yelling as he does so.  CARPET pulls a ALADDIN down.)  Whoa!  Does it feel good to be outta there! (GENIE uses the lamp end of himself as a microphone.) Nice to be back, ladies and gentlemen.  Hi, where ya from? (Sticks the mic in ALADDIN's face.)  What's your name?"}
{"speaker": "ALADDIN", "text": "Uh, Al--uh--Aladdin."}
{"speaker": "GENIE", "text": "(Says his name as if he's discovered something major) Aladdin! (A neon sign lights up with ALADDIN's name on it, circled by chase lights.  The sign changes to reflect the GENIE's upcoming line.) Hello, Aladdin.  Nice to have you on the show.  Can we call you 'Al?' Or maybe just 'Din?'  Or how bout 'Laddi?'  (GENIE disappears, then a dog wrapped in plaid jumps in.) Sounds like 'Here, boy! C'mon, Laddi!'"}
{"speaker": "ALADDIN", "text": "(Shaking his head) I must have hit my head harder than I thought."}
{"speaker": "GENIE", "text": "(Still a dog) Do you smoke?  Mind if I do? (Dog poofs into smoke, then back to the GENIE.  ABU screeches wildly.)  Oh, sorry Cheetah--hope I didn't singe the fur!  Hey, Rugman!  Haven't seen you in a few millennia!  Slap me some tassel!  Yo! Yeah! (CARPET flies over and high fives the GENIE. GENIE looks at ALADDIN.)  Say, you're a lot smaller than my last master. (Lifts his beer-gut.)  Either that or I'm gettin' bigger.  Look at me from the side--do I look different to you?"}
{"speaker": "ALADDIN", "text": "Wait a minute!  I'm--your master?"}
{"speaker": "GENIE", "text": "(Slaps a diploma in ALADDIN's hand and a mortarboard on his head.)  That's right!  He can be taught!! What would you wish of me, (as Arnold Schwarzenegger)  the ever impressive,(inside a cube) the long contained, (as a ventriloquist with a dummy) often imitated, (tosses the dummy aside) but never duplicated--  DUP. GENIES:    Duplicated, duplicated,  duplicated, duplicated,  duplicated,  duplicated, duplicated, duplicated, duplicated."}
{"speaker": "GENIE", "text": "(Says it like a ring announcer at a boxing match.) Genie!  Of!  The Lamp!  (Goes into Ed Sullivan)  Right here direct from the lamp, right here for your enjoyment wish fulfillment. Thank youuuuu!"}
{"speaker": "ALADDIN", "text": "Whoa!  Wish fulfillment?"}
{"speaker": "GENIE", "text": "Three wishes to be exact.  And ix-nay on the wishing for more wishes.  (Turns into a slot machine, arm pulls down and three GENIEs appear in the windows.)  That's it--three.  (Three GENIE caballeros come out of the slot.)  Uno, dos, tres."}
{"speaker": "ALADDIN", "text": "(To ABU) Now I know I'm dreaming."}
{"speaker": "GENIE", "text": "(Music for \"Friend Like Me\" begins) Master, I don't think you quite realize what you've got here! So why don't you just ruminate, whilst I illuminate the possibilities.  (GENIE lights up like a fluorescent light)  Well Ali Baba had them forty thieves Scheherazadie had a thousand tales But master you in luck 'cause up your sleeve You got a brand of magic never fails! "}
{"speaker": "GENIE", "text": "So what'll it be, master?"}
{"speaker": "ALADDIN", "text": "You're gonna grant me any three wishes I want?"}
{"speaker": "GENIE", "text": "(As William F. Buckley) Ah, almost.  There are a few provisos, a couple of quid pro quos"}
{"speaker": "ALADDIN", "text": "Like?"}
{"speaker": "GENIE", "text": "Ah, rule number one: I can't kill anybody.  (He slices his head off with his finger.)  So don't ask.  Rule two: I can't make anyone fall in love with anyone else.  (Head turns into a big pair of lips which kiss ALADDIN.)  You little punim, there."}
{"speaker": "ALADDIN", "text": "(Looks at ABU as if plotting) Ah, provisos?  You mean limitations?  On wishes? (To ABU) Some all powerful genie--can't even bring people back from the dead. I don't know, Abu--he probably can't even get us out of this cave.  Looks like we're gonna have to find a way out of here-- "}
{"speaker": "GENIE", "text": "Excuse me?  Are you lookin' at me?  Did you rub my lamp? Did you wake me up, did you bring me here?  And all of a sudden, you're walkin' out on me?  (Gets madder and madder) I don't think so, not right now.  You're gettin' your wishes, so siddown!  (They all get on CARPET. GENIE takes the form of a stewardess, with lots of arms pointing out the exits.)  In case of emergency, the exits are here, here, here, here,here, here, here, here, here, here, here, here, anywhere!  Keep your hands and arms inside the carpet.  Weeee'rrrrrreee...outta here! "}
{"speaker": "SULTAN", "text": "Jafar, this is an outrage.  If it weren't for all your years of loyal service... . From now on, you are to discuss sentencing of prisoners with me, before they are beheaded."}
{"speaker": "JAFAR", "text": "I assure you, your highness, it won't happen again."}
{"speaker": "SULTAN", "text": "Jasmine, Jafar, now let's put this whole messy business behind us.  Please?"}
{"speaker": "JAFAR", "text": "My most abject and humblest apologies to you as well, princess.  (He takes her hand to kiss it, but she yanks it away.)"}
{"speaker": "JASMINE", "text": "At least some good will come of my being forced to marry.  When I am queen, I will have the power to get rid of you."}
{"speaker": "SULTAN", "text": "That's nice.  All settled, then.  Now, Jasmine, getting back to this suitor business, (he looks and sees Jasmine walking out) Jasmine? Jasmine!  (He runs after her.)"}
{"speaker": "JAFAR", "text": "If only I had gotten that lamp!"}
{"speaker": "IAGO", "text": "(As JASMINE) I will have the power to get rid of you!  D'oh!  To think--we gotta keep kissing up to that chump, and his chump daughter for the rest of our lives..."}
{"speaker": "JAFAR", "text": "No, Iago.  Only until she finds a chump husband. Then she'll have us banished--or beheaded!"}
{"speaker": "BOTH", "text": "Eeewww!"}
{"speaker": "IAGO", "text": "(Has an idea) Oh!  Wait a minute!  Wait a minute! Jafar?  What if you were the chump husband?"}
{"speaker": "JAFAR", "text": "(He looks at IAGO in insult)  What?"}
{"speaker": "IAGO", "text": "Okay, you marry the princess,all right? Then, uh, you become sultan!"}
{"speaker": "JAFAR", "text": "Oh!Marry the shrew?  I become sultan.  The idea has merit!"}
{"speaker": "IAGO", "text": "Yes, merit! Yes!  And then we drop papa-in-law and the little woman off a cliff!  (Dive bombs into the floor)  Kersplat!"}
{"speaker": "JAFAR", "text": "Iago, I love the way your foul little mind works! "}
{"speaker": "GENIE", "text": "(Still as stewardess) Thank you for choosing Magic Carpet for all your travel needs.  Don't stand until the rug has come to a complete stop.  (As ALADDIN and ABU get off down the stairway formed by CARPET) Thank you.  Good bye, good bye!  Thank you! Good bye!  (Back to normal)  Well, now.  How about that, Mr.  doubting mustafa?"}
{"speaker": "ALADDIN", "text": "Oh, you sure showed me.  Now about my three wishes-"}
{"speaker": "GENIE", "text": "Dost mine ears deceive me?  Three? You are down by ONE, boy!"}
{"speaker": "ALADDIN", "text": "Ah, no--I never actually wished to get out of the cave.  You did that on your own. "}
{"speaker": "GENIE", "text": "Well, don't I feel just sheepish?  All right, you baaaaad boy,  but no more freebies."}
{"speaker": "ALADDIN", "text": "Fair deal.  So, three wishes.  I want them to be good.  (To GENIE) What would you wish for? "}
{"speaker": "GENIE", "text": "Me?  No one's ever asked me that before. Well, in my case, ah, forget it."}
{"speaker": "ALADDIN", "text": "What?  No, tell me."}
{"speaker": "GENIE", "text": "Freedom."}
{"speaker": "ALADDIN", "text": "You're a prisoner?"}
{"speaker": "GENIE", "text": "It's all part-and-parcel, the whole genie gig."}
{"speaker": "ALADDIN", "text": "Genie, that's terrible."}
{"speaker": "GENIE", "text": "(Comes out of the LAMP) But, oh--to be free.  Not have to go \"Poof! What do you need? Poof! What do you need? Poof! What do you need?\"  To be my own master, such a thing would be greater than all the magic and all the treasures in all  the world! But what am I talking about, here?  Let's get real here.  It's not gonna happen.  Genie, wake up and smell the hummus"}
{"speaker": "ALADDIN", "text": "Why not?"}
{"speaker": "GENIE", "text": "The only way I get outta this is if my master wishes me out.  So you can guess how often that's happened."}
{"speaker": "ALADDIN", "text": "I'll do it. I'll set you free."}
{"speaker": "GENIE", "text": "(Head turns into Pinocchio's with a long nose) Uh huh, right.  Whoop!"}
{"speaker": "ALADDIN", "text": "No, really, I promise.  (He pushes the nose back in and GENIE's head returns to normal.) After make my first two wishes, I'll use my third wish to set you free.   (He holds out his hand)"}
{"speaker": "GENIE", "text": "Well, here's hopin'.  (Shakes ALADDIN's hand.) O.K.   Let's make some magic!  (Turns into a magician.)  So how 'bout it.  What is it you want most?"}
{"speaker": "ALADDIN", "text": "Well, there's this girl--"}
{"speaker": "GENIE", "text": "Eehhh! (Like a buzzer, and GENIE's chest shows a heart with a cross through it.)  Wrong!  I can't make anybody fall in love, remember?"}
{"speaker": "ALADDIN", "text": "Oh, but Genie.  She's smart and fun and..."}
{"speaker": "GENIE", "text": "Pretty?"}
{"speaker": "ALADDIN", "text": "Beautiful.  She's got these eyes that just...and this hair, wow...and her smile."}
{"speaker": "GENIE", "text": "(Sitting in a Parisian cafe with ABU and CARPET.) Ami.  C'est l'amour."}
{"speaker": "ALADDIN", "text": "But she's the princess.  To even have a chance, I'd have to be a--hey, can you make me a prince?"}
{"speaker": "GENIE", "text": "Let's see here.  (Has a \"Royal Cookbook\".) Uh, chicken a'la king? (Pulls out a chicken with a crown on its head)  Nope.  Alaskan king crab?"}
{"speaker": "ALADDIN", "text": "Genie, I wish for you to make me a prince!"}
{"speaker": "GENIE", "text": "All right!  Woof woof woof woof! (Takes on square shoulders and looks like Arsenio Hall. Then becomes a tailor/fashion designer.)  First, that fez and vest combo is much too third century. These patches--what are we trying to say--beggar?  No! Let's work with me here. (He takes ALADDIN's measurements, snaps his fingers and ALADDIN is outfitted in his prince costume.)  I like it, muy macho!  Now, still needs something.  What does it say to me?  It says mode of transportation.  Excuse me, monkey boy!  Aqui, over here!  (ABU tries to cover himself with CARPET, but GENIE zaps him and he flies over.)"}
{"speaker": "ABU", "text": "Uh oh!"}
{"speaker": "GENIE", "text": "Here he comes, (ALADDIN and GENIE are on a game show set, where ALADDIN stands behind a podium with \"AL\" on it.)  And what better way to make your grand entrance on the streets of Agrabah, than riding your very own brand new camel!  Watch out, it spits!  (A door bearing the GENIE's head on it opens, where ABU is transformed into a camel.  He spits out the side of his mouth on cue.  But the GENIE's not sure.)  Mmm, not enough.  (He snaps his fingers and ABU turns into a fancy white horse.) Still not enough.  Let's see.  What do you need?"}
{"speaker": "ALADDIN", "text": "Abu, you look good."}
{"speaker": "GENIE", "text": "He's got the outfit, he's got the elephant, but we're not through yet.  Hang on to your turban, kid, cause we're gonna make you a star! "}
{"speaker": "JAFAR", "text": "Sire, I have found a solution to the problem with your daughter."}
{"speaker": "IAGO", "text": "Awk!  The problem with your daughter!"}
{"speaker": "SULTAN", "text": "Oh, really?"}
{"speaker": "JAFAR", "text": "(Unrolling a scroll) Right here.  \"If the princess has not chosen a husband by the appointed time, then the sultan shall choose for her.\""}
{"speaker": "SULTAN", "text": "But Jasmine hated all those suitors!  (He tries to stuff a cracker into IAGO's mouth.  IAGO backs away.  The SULTAN absentmindedly pulls the cracker back.)  How could I choose someone she hates?"}
{"speaker": "JAFAR", "text": "Not to worry, my liege.  There is more.  If, in the event a suitable prince cannot be found, a princess must then be wed to...hmm...interesting."}
{"speaker": "SULTAN", "text": "What?  Who?"}
{"speaker": "JAFAR", "text": "The royal vizier!  Why, that would be...me!"}
{"speaker": "SULTAN", "text": "Why, I thought the law says that only a prince can marry a princess, I'm quite sure."}
{"speaker": "JAFAR", "text": "Desperate times call for desperate measures, my lord.  (He pulls out the staff and hypnotizes the SULTAN with it.)"}
{"speaker": "SULTAN", "text": "Yes...desperate measures..."}
{"speaker": "JAFAR", "text": "You will order the princess to marry me."}
{"speaker": "SULTAN", "text": "I...will order...the princess...to...(the spell breaks momentarily)...but you're so old!"}
{"speaker": "JAFAR", "text": "(Holds the staff closer) The princess will marry me!"}
{"speaker": "SULTAN", "text": "The princess will marry...(the spell is again broken, this time by the trumpet fanfare of \"Prince Ali\".)  What? What is that?  That music!  Ha ha ha. Jafar., you must come and see this! "}
{"speaker": "MARCHERS", "text": "Make way for Prince Ali!"}
{"speaker": "SWORDSMEN", "text": "Say hey!  It's Prince Ali!"}
{"speaker": "MAJOR", "text": "Hey, clear the way in the old bazaar, Hey you, let us through, it's a bright new star, Now come, be the first on your block to meet his eye! Make way, here he comes, Ring bells, bang the drums. You're gonna love this guy  CHORUS OF MEN:(Carrying the camels) He's got seventy-five golden camels! "}
{"speaker": "HARRY", "text": "Don't they look lovely, June?  CHORUS OF WOMEN:    (On a float)  Purple peacocks, he's got fifty-three! "}
{"speaker": "JUNE", "text": "Fabulous, Harry, I love the feathers! "}
{"speaker": "GENIE", "text": "(GENIE is off screen, a giant balloon gorilla proceeds down the parade) When it comes to exotic type mammals Has he got a zoo, I'm telling you It's a world class menagerie! "}
{"speaker": "CHORUS", "text": "He's got ninety-five white Persian monkeys!"}
{"speaker": "GENIE", "text": "Prince Ali! Amorous he!  Ali Ababwa Heard your princess was a sight lovely to see! And that,good people, is why He got dolled up and dropped by With sixty elephants, llamas galore With his bears and lions A brass band and more With his forty fakirs, his cooks, his bakers His birds that warble on key Make way for Prince Ali! "}
{"speaker": "SULTAN", "text": "(Clapping) Splendid, absolutely marvelous."}
{"speaker": "ALADDIN", "text": "(Takes on a deeper voice.)  Ahem.  Your majesty, I have journeyed from afar to seek your daughter's hand."}
{"speaker": "SULTAN", "text": "Prince Ali Ababwa!  Of course.  I'm delighted to meet you.  (He rushes over and shakes ALI's hand.) This is my royal vizier, Jafar.  He's delighted too."}
{"speaker": "JAFAR", "text": "(Extremely dryly) Ecstatic.  I'm afraid, Prince Abooboo--"}
{"speaker": "ALADDIN", "text": "--Ababwa!"}
{"speaker": "JAFAR", "text": "Whatever.  You cannot just parade in here uninvited and expect to--"}
{"speaker": "SULTAN", "text": "...by Allah, this is quite a remarkable device."}
{"speaker": "ALADDIN", "text": "Why certainly, your majesty.  Allow me. "}
{"speaker": "JAFAR", "text": "Sire, I must advise against this--"}
{"speaker": "SULTAN", "text": "--Oh, button up, Jafar.  Learn to have a little fun. "}
{"speaker": "JAFAR", "text": "Just where did you say you were from?"}
{"speaker": "ALADDIN", "text": "Oh, much farther than you've traveled, I'm sure."}
{"speaker": "JAFAR", "text": "Try me.  (IAGO lands on the staff.)"}
{"speaker": "SULTAN", "text": "Look out, Polly! "}
{"speaker": "IAGO", "text": "Hey, watch it. Watch it with the dumb rug! "}
{"speaker": "SULTAN", "text": "Out of the way, I'm coming in to land.  Jafar, watch this!  (He lands.)"}
{"speaker": "JAFAR", "text": "Spectacular, your highness."}
{"speaker": "SULTAN", "text": "Ooh, lovely.  Yes, I do seem to have a knack for it.  (CARPET walks over to ABU dizzily, then collapses.  ABU catches it.)  This is a very impressive youth. And a prince as well.   (Whispers to JAFAR) If we're lucky, you won't have to marry Jasmine after all."}
{"speaker": "JAFAR", "text": "I don't trust him, sire."}
{"speaker": "SULTAN", "text": "Nonsense.  One thing I pride myself on Jafar, I'm an excellent judge of character."}
{"speaker": "IAGO", "text": "Oh, excellent judge, yeah, sure...not!!! "}
{"speaker": "SULTAN", "text": "Jasmine will like this one!"}
{"speaker": "ALADDIN", "text": "And I'm pretty sure I'll like Princess Jasmine!"}
{"speaker": "JAFAR", "text": "Your highness, no.  I must intercede on Jasmine's behalf.  (JASMINE hears this and gets mad.) This boy is no different than the others.  What makes him think he is worthy of the princess?"}
{"speaker": "ALADDIN", "text": "Your majesty, I am Prince Ali Ababwa! (He pricks JAFAR's goatee, which springs out in all directions.)  Just let her meet me.  I will win your daughter!"}
{"speaker": "JASMINE", "text": "How dare you!  (They all look at her surprised.) All of you, standing around deciding my future?  I am not a prize to be won!  (She storms out.)"}
{"speaker": "SULTAN", "text": "Oh, dear.  Don't worry, Prince Ali.  Just give Jasmine time to cool down.  (They exit.)"}
{"speaker": "JAFAR", "text": "I think it's time to say good bye to Prince Abooboo. "}
{"speaker": "ALADDIN", "text": "What am I going to do?  Jasmine won't even let me talk to her.  I should have known I couldn't pull off this stupid prince wish.  (ABU struggles with his elephant paws to open a banana.  He squishes it, and the banana squirts into his eye.  He then tosses the banana peel into a heaping pile of the same.)"}
{"speaker": "GENIE", "text": "(to carpet, playing chess) So move!  (CARPET does, knocking a black piece off the board.)  Hey. That's a good move.  (As Rodney Dangerfield) I can't believe it--I'm losing to a rug."}
{"speaker": "ALADDIN", "text": "Genie, I need help."}
{"speaker": "GENIE", "text": "(as Jack Nicholson) All right, sparky, here's the deal.  You wanna court the little lady, you gotta be a straight shooter, do ya follow me?"}
{"speaker": "ALADDIN", "text": "What?"}
{"speaker": "GENIE", "text": "(Back to normal, wearing a mortarboard. He points out his words on a blackboard)  Tell her the...TRUTH!!!"}
{"speaker": "ALADDIN", "text": "No way!  If Jasmine found out I was really some crummy street rat, she'd laugh at me. (He puts on his turban, which lights up as the GENIE.)"}
{"speaker": "GENIE", "text": "A woman appreciates a man who can make her laugh!"}
{"speaker": "ALADDIN", "text": "Hey, that's the last thing I want to  be.  Okay, I'm gonna go see her.  I gotta be smooth, cool, confident.  How do I look?"}
{"speaker": "GENIE", "text": "(Sadly) Like a prince. "}
{"speaker": "ALADDIN", "text": "(From a distance) Princess Jasmine? "}
{"speaker": "JASMINE", "text": "Who's there?"}
{"speaker": "ALADDIN", "text": "It's me--Prince Ali.  Ahem--(Then he jumps to his deep voice) Prince Ali Ababwa."}
{"speaker": "JASMINE", "text": "I do not want to see you."}
{"speaker": "ALADDIN", "text": "No, no, please princess.  Give me a chance. (RAJAH growls and advances on him.)"}
{"speaker": "JAFAR", "text": "Just leave me alone."}
{"speaker": "ALADDIN", "text": "Down kitty! "}
{"speaker": "GENIE", "text": "How's our beau doing? "}
{"speaker": "ALADDIN", "text": "Good kitty, take off.  Down kitty. (He takes off his turban to brush RAJAH away.)"}
{"speaker": "JASMINE", "text": "(She looks at him thinking she has seen him before.)  Wait, wait.  Do I know you?"}
{"speaker": "ALADDIN", "text": "(Quickly replaces his turban) Uh, no, no."}
{"speaker": "JASMINE", "text": "You remind me of someone I met in  the marketplace."}
{"speaker": "ALADDIN", "text": "The marketplace?  (A bee buzzes around his head.) I have servants that go to the marketplace for me. Why I even have servants who go to the marketplace for my servants, so it couldn't have been me you met."}
{"speaker": "JASMINE", "text": "(She looks disappointed.)  No, I guess not."}
{"speaker": "BEE", "text": "(It's the GENIE) Enough about you, Casanova.  Talk about her! She's smart,  fun, the hair, the eyes. Anything--pick a feature!"}
{"speaker": "ALADDIN", "text": "Um, Princess Jasmine?  You're very..."}
{"speaker": "BEE", "text": "Wonderful, glorious, magnificent, punctual!"}
{"speaker": "ALADDIN", "text": "Punctual!"}
{"speaker": "JASMINE", "text": "Punctual?"}
{"speaker": "BEE", "text": "Sorry."}
{"speaker": "ALADDIN", "text": "Beautiful."}
{"speaker": "BEE", "text": "Nice recovery."}
{"speaker": "JASMINE", "text": "Hmm.  I'm rich too, you know."}
{"speaker": "ALADDIN", "text": "Yeah!"}
{"speaker": "JASMINE", "text": "The daughter of a sultan"}
{"speaker": "ALADDIN", "text": "I know."}
{"speaker": "JASMINE", "text": "A fine prize for any  prince to marry."}
{"speaker": "ALADDIN", "text": "Uh, right.  Right.  A prince like me."}
{"speaker": "BEE", "text": "(Buzzing in his ear) Warning! Warning!"}
{"speaker": "JASMINE", "text": "Right, a prince like you.  And every other stuffed  shirt, swaggering, peacock I've met!"}
{"speaker": "BEE", "text": "(Rear end on fire, wearing goggles and crashing) Mayday! Mayday!"}
{"speaker": "JASMINE", "text": "Just go jump off a balcony! (She turns and walks away)"}
{"speaker": "ALADDIN", "text": "What?"}
{"speaker": "BEE", "text": "Stop her! Stop her! Do you want me to sting her?"}
{"speaker": "ALADDIN", "text": "(Swats at bee) Buzz off!"}
{"speaker": "BEE", "text": "Okay, fine.  But remember--bee yourself! (BEE buzzes into his turban)"}
{"speaker": "ALADDIN", "text": "Yeah, right!"}
{"speaker": "JASMINE", "text": "What!?!"}
{"speaker": "ALADDIN", "text": "Uh, you're right.  You aren't just some prize to be won.  (He looks disappointed.)  You should be free to make your own choice.  (JASMINE and RAJAH look at each other in confusion.)  I'll go now. (He steps up on the ledge and drops off.)"}
{"speaker": "JASMINE", "text": "No!"}
{"speaker": "ALADDIN", "text": "(Pokes his head up from over the edge) What?  What?"}
{"speaker": "JASMINE", "text": "(Now she's amazed) How--how are you doing that?"}
{"speaker": "ALADDIN", "text": "It's a magic carpet."}
{"speaker": "JASMINE", "text": "It's lovely.  (CARPET takes JASMINE's hand with a tassel.)"}
{"speaker": "ALADDIN", "text": "You, uh, you don't want to go for a ride, do you? We could get out of the palace, see the world."}
{"speaker": "JASMINE", "text": "Is it safe?"}
{"speaker": "ALADDIN", "text": "Sure.  Do you trust me?"}
{"speaker": "JASMINE", "text": "(She looks at him at the saying of that all- important line) What?"}
{"speaker": "ALADDIN", "text": "(Extends his hand the same as before) Do you trust me?"}
{"speaker": "JASMINE", "text": "(Gets a sly grin on her face) Yes. "}
{"speaker": "ALADDIN", "text": "I can show you the world Shining, shimmering, splendid. Tell me princess, now when did you last Let your heart decide? "}
{"speaker": "JASMINE", "text": "A whole new world A dazzling place I never knew But when I'm way up here It's crystal clear That now I'm in a whole new world with you! "}
{"speaker": "ALADDIN", "text": "Now I'm in a whole new world with you! "}
{"speaker": "JASMINE", "text": "Unbelievable sights Indescribable feeling Soaring, tumbling, freewheeling Through an endless diamond sky "}
{"speaker": "JASMINE", "text": "A whole new world!"}
{"speaker": "ALADDIN", "text": "Don't you dare close your eyes"}
{"speaker": "JASMINE", "text": "An hundred thousand things to see"}
{"speaker": "ALADDIN", "text": "Hold your breath--it gets better!"}
{"speaker": "JASMINE", "text": "I'm like a shooting star, I've come so far I can't go back to where I used to be! "}
{"speaker": "ALADDIN", "text": "A whole new world!"}
{"speaker": "JASMINE", "text": "Every turn a surprise"}
{"speaker": "ALADDIN", "text": "With new horizons to pursue"}
{"speaker": "JASMINE", "text": "Every moment, red-letter "}
{"speaker": "BOTH", "text": "I'll chase them anywhere There's time to spare Let me share this whole new world with you  A whole new world That's where we'll be "}
{"speaker": "ALADDIN", "text": "A thrilling chase"}
{"speaker": "JASMINE", "text": "A wondrous place"}
{"speaker": "BOTH", "text": "For you and me! "}
{"speaker": "JASMINE", "text": "It's all so magical."}
{"speaker": "ALADDIN", "text": "Yeah."}
{"speaker": "JASMINE", "text": "(She looks at him and decides to burst the bubble) It's a shame Abu had to miss this."}
{"speaker": "ALADDIN", "text": "Nah.  He hates fireworks.  (CARPET looks up realizing what is happening.)  He doesn't really like flying either. (And now ALADDIN realizes it) That is...oh no!"}
{"speaker": "JASMINE", "text": "(She pulls off his turban) You are the boy from the market!  I knew it.  Why did you lie to me?"}
{"speaker": "ALADDIN", "text": "Jasmine, I'm sorry."}
{"speaker": "JASMINE", "text": "Did you think I was stupid?"}
{"speaker": "ALADDIN", "text": "No!"}
{"speaker": "JASMINE", "text": "That I wouldn't figure it out?"}
{"speaker": "ALADDIN", "text": "No.  I mean, I hoped you wouldn't.  No, that's not what I meant."}
{"speaker": "JASMINE", "text": "Who are you?  Tell me the truth!"}
{"speaker": "ALADDIN", "text": "The truth? (He looks at CARPET who wave him on, giving up hope.)  The truth...the truth is...I sometimes dress as a commoner to escape the pressures of palace life.  (CARPET slumps down in defeat.)  But I really am a prince! (The feather on his turban falls down over his eyes.)"}
{"speaker": "JASMINE", "text": "Why didn't you just tell me?"}
{"speaker": "ALADDIN", "text": "Well, you know, um...royalty going out into the city in disguise, it sounds a little strange, don't you think?"}
{"speaker": "JASMINE", "text": "Not that strange. "}
{"speaker": "JASMINE", "text": "Good night, my handsome prince."}
{"speaker": "ALADDIN", "text": "Sleep well, princess. "}
{"speaker": "ALADDIN", "text": "Yes!  (He falls back onto the CARPET, who descends to the ground.) For the first time in my life, things are starting to go right. "}
{"speaker": "ALADDIN", "text": "Hey!  What?  (A gag is tied around his mouth. Muffled words) Abu!  Abu!  (We see the elephant hanging from a net tied in a tree.)"}
{"speaker": "GUARD", "text": "Hold him! "}
{"speaker": "JAFAR", "text": "I'm afraid you've worn out your welcome, Prince Abooboo.  (Walks away.)  Make sure he's never found. "}
{"speaker": "GENIE", "text": "Never fails.  Get in the bath and there's a rub at the lamp.  (Squeaks the duck)  Hello.  (Sees unconscious ALADDIN) Al?  Al!  Kid, snap out of it! You can't cheat on this one!  I can't help you unless you make a wish.  You have to say  \"Genie I want you to save my life.\"  Got it?  Okay.  C'mon Aladdin!!  (He grabs ALADDIN by the shoulders and shakes him.  His head goes up, then falls.)  I'll take that as a yes.  (Head turns into a siren.) Wooga!  Wooga!  (Turns into a submarine.)  Up scope!  (He babbles in something that sounds like German.  On the surface, a giant water spout emerges, and lands on top of the cliff.  ALADDIN reawakes and coughs the water out of his lungs.) Don't you scare me like that!"}
{"speaker": "ALADDIN", "text": "Genie, I--uh, I-uh...(He can't think of how to say it, so they just hug each other.)  Thanks, Genie."}
{"speaker": "GENIE", "text": "Oh, Al.  I'm gettin' kind of fond of you, kid.  Not that I want to pick out curtains or anything. "}
{"speaker": "SULTAN", "text": "Jasmine!"}
{"speaker": "JASMINE", "text": "Oh, father--I just had the most wonderful time. I'm so happy."}
{"speaker": "SULTAN", "text": "(Still monotone from the hypnosis) You should be, Jasmine. I have chosen a husband for you."}
{"speaker": "JASMINE", "text": "What?"}
{"speaker": "SULTAN", "text": "(The other door opens and reveals JAFAR.)  You will wed Jafar. "}
{"speaker": "JAFAR", "text": "You're speechless, I see.  A fine quality in a wife."}
{"speaker": "JASMINE", "text": "I will never marry you.  (She goes to the SULTAN) Father, I choose Prince Ali!"}
{"speaker": "JAFAR", "text": "Prince Ali left! "}
{"speaker": "ALADDIN", "text": "Better check your crystal ball  again, Jafar!"}
{"speaker": "JASMINE", "text": "Prince Ali! "}
{"speaker": "IAGO", "text": "How in the he--(back to parrot-ese)--uh, awk!"}
{"speaker": "ALADDIN", "text": "Tell them the truth, Jafar!  You tried to have me killed."}
{"speaker": "JAFAR", "text": "What?  (He goes to the SULTAN)  Ridiculous nonsense, your highness.  He is obviously lying."}
{"speaker": "SULTAN", "text": "Obviously...lying. "}
{"speaker": "JASMINE", "text": "Father, what's wrong with you?"}
{"speaker": "ALADDIN", "text": "I know! "}
{"speaker": "SULTAN", "text": "Oh, oh, oh my!"}
{"speaker": "ALADDIN", "text": "Your highness, Jafar's been controlling you with this!  (He advances the staff)"}
{"speaker": "SULTAN", "text": "What?  Jafar?  You, you traitor! "}
{"speaker": "JAFAR", "text": "Your majesty, all of this can be explained."}
{"speaker": "SULTAN", "text": "Guards! Guards!"}
{"speaker": "IAGO", "text": "Well, that's it--we're dead, forget about it.  Just dig a grave for both of us.  We're dead. "}
{"speaker": "SULTAN", "text": "Arrest Jafar at once."}
{"speaker": "JAFAR", "text": "This is not done yet, boy! "}
{"speaker": "SULTAN", "text": "Find him, search everywhere!"}
{"speaker": "ALADDIN", "text": "Jasmine, are you all right?"}
{"speaker": "JASMINE", "text": "Yes. "}
{"speaker": "SULTAN", "text": "Jafar, my most trusted counselor, plotting against me all this time.  Just horrible.  How will I ever-"}
{"speaker": "ALADDIN", "text": "Sultan?"}
{"speaker": "SULTAN", "text": "Yes, a fine upstanding youth like yourself, a person of your unimpeachable moral character is exactly what this kingdom needs!  (ALADDIN looks concerned at this.) "}
{"speaker": "IAGO", "text": "We gotta get outta here!  We gotta get--  I gotta start packing, your highness.  Only essentials."}
{"speaker": "JAFAR", "text": "Prince Ali is nothing more than that ragged urchin Aladdin.  He has the lamp, Iago."}
{"speaker": "IAGO", "text": "Why that miserable--"}
{"speaker": "JAFAR", "text": "But you are going to relieve him of it!"}
{"speaker": "IAGO", "text": "Me? "}
{"speaker": "ALADDIN", "text": "Sultan?  They want me to be sultan? "}
{"speaker": "GENIE", "text": "Huzzah!  Hail the conquering hero!  (Turns into a one-man band.  He sees ALADDIN walk away with his head hung.  He stops, scratches his head, comes up with an idea, then zooms over to ALADDIN.  He holds up his hands like a director scoping a picture and we look through them.)  Aladdin, you've just won the heart of the princess.  What are you gonna do next?  (ALADDIN looks at him, then walks away in sadness to the bed, where he falls on it and sighs. GENIE again is confused, then goes to him and pulls out a script labeled \"Aladdin.\" Whispering: ) Psst, your line is \"I'm going to free the genie.\" Anytime."}
{"speaker": "ALADDIN", "text": "Genie...I can't."}
{"speaker": "GENIE", "text": "Sure you can.  You just go \"Genie, I wish you free.\"  (He grabs ALADDIN's head and uses him as a mock ventriloquist's dummy.  ALADDIN pulls away.)"}
{"speaker": "ALADDIN", "text": "I'm serious.  Look, I'm sorry--I really am. But they want to make me sultan--no!, They want to make Prince Ali sultan.  Without you, I'm just Aladdin."}
{"speaker": "GENIE", "text": "Al, you won!"}
{"speaker": "ALADDIN", "text": "Because of you!  The only reason anyone thinks I'm anything is because of you.  What if they find out I'm not really a prince?  (Quietly)  What if Jasmine finds out?  I'll lose her.  Genie, I can't keep this up on my own.  I can't wish you free."}
{"speaker": "GENIE", "text": "(Sarcastically) Hey, I understand.  After all, you've lied to everyone else.  Hey, I was beginning to feel left out.  Now, if you'll excuse me, master. (He says the last word in disgust, then poofs back into the lamp.) "}
{"speaker": "ABU", "text": "Ohhh."}
{"speaker": "ALADDIN", "text": "Genie, I'm really sorry. (A tongue comes out of the spout and raspberries him.)   Well, fine. (He slams a pillow on top of the LAMP.)  Then just stay in there!  (He looks at ABU and CARPET.)  What are you guys looking at? (They both leave.) Look, I--I'm sorry.  Wait, Abu-- wait--I'm sorry, I didn't-- wait, c'mon.  (He sighs.)  What am I doing? Genie's right--I gotta tell Jasmine the truth."}
{"speaker": "JASMINE", "text": "(From a distance)  Ali, oh Ali--will you come here?"}
{"speaker": "ALADDIN", "text": "(Putting on his turban) Well, here goes.  (He walks into the garden.)  Jasmine?  Where are you? "}
{"speaker": "IAGO", "text": "Ahem--In the menagerie, hurry."}
{"speaker": "ALADDIN", "text": "I'm coming. "}
{"speaker": "FLAMINGO", "text": "D'uh!"}
{"speaker": "IAGO", "text": "Ya got a problem, pinky?  (He sweeps the bird's feet out from under it. IAGO runs into the palace and finds the lamp under the pillow.)  Boy, Jafar's gonna be happy to see you!  (Stretches his face like JAFAR's and imitates it.)  Good work, Iago!"}
{"speaker": "SULTAN", "text": "People of Agrabah, My daughter has finally chosen a suitor! "}
{"speaker": "ALADDIN", "text": "Jasmine?"}
{"speaker": "JASMINE", "text": "Ali, where have you been?"}
{"speaker": "ALADDIN", "text": "There's something I've got to tell you."}
{"speaker": "JASMINE", "text": "The whole kingdom has turned out for father's announcement!"}
{"speaker": "ALADDIN", "text": "No! But Jasmine, listen to me, please!"}
{"speaker": "JASMINE", "text": "Good luck!  (She pushes him out onto the platform with the SULTAN, where he overlooks the entire crowd.)"}
{"speaker": "SULTAN", "text": "...Ali Ababwa!"}
{"speaker": "ALADDIN", "text": "Oh, boy! "}
{"speaker": "IAGO", "text": "Look at them, cheering that little pipsqueak."}
{"speaker": "JAFAR", "text": "Let them cheer. "}
{"speaker": "GENIE", "text": "You know Al, I'm getting (turns and sees JAFAR) reallyyyyyy--I don't think you're him.  (He descends and consults a playbill.)  Tonight, the role of Al will be played by a tall, dark and sinister ugly man."}
{"speaker": "JAFAR", "text": "I am your master now.  (He throws GENIE to the ground and puts his foot on GENIE's face.)"}
{"speaker": "GENIE", "text": "I was afraid of that."}
{"speaker": "JAFAR", "text": "Genie, grant me my first wish.  I wish to rule on high, as sultan!!! "}
{"speaker": "ALADDIN", "text": "Whoa!"}
{"speaker": "SULTAN", "text": "Bless my soul.  What is this?  What is going on? "}
{"speaker": "JAFAR", "text": "Heh heh heh!"}
{"speaker": "SULTAN", "text": "Jafar, you vile betrayer."}
{"speaker": "IAGO", "text": "That's Sultan Vile Betrayer to you."}
{"speaker": "ALADDIN", "text": "Oh, yeah?  Well, we'll just see about that!  (Pulls off his own turban, but finds it empty)  The lamp!"}
{"speaker": "JAFAR", "text": "Finders-keepers, Abooboo. "}
{"speaker": "ALADDIN", "text": "Genie!  No!"}
{"speaker": "GENIE", "text": "Sorry, kid--I got a new master now.  (He places the palace on top of a mountain.)"}
{"speaker": "SULTAN", "text": "Jafar, I order you to stop!"}
{"speaker": "JAFAR", "text": "There's a new order now--my order!  Finally, you will bow to me! "}
{"speaker": "JAFAR", "text": "We'll never bow to you!"}
{"speaker": "IAGO", "text": "Why am I not surprised?"}
{"speaker": "JAFAR", "text": "If you will not bow before a sultan, then you will cower before a sorcerer!  (To GENIE)  Genie, my second wish--I wish to be the most powerful sorcerer in the world! "}
{"speaker": "IAGO", "text": "Ladies and gentlemen, a warm Agrabah welcome for Sorcerer Jafar!"}
{"speaker": "JAFAR", "text": "Now where were we?  Ah, yes--abject humiliation!"}
{"speaker": "ALADDIN", "text": "(off-camera) Jafar!  Get your hands off her! "}
{"speaker": "JAFAR", "text": "Prince Ali Yes, it is he, But not as you know him. Read my lips and come to grips With reality "}
{"speaker": "IAGO", "text": "Or should we say Aladdin?"}
{"speaker": "ALADDIN", "text": "Jasmine, I tried to tell you. "}
{"speaker": "JAFAR", "text": "So Ali turns out to be merely Aladdin Just a con, need I go on? Take it from me His personality flaws Give me adequate cause To send him packing on a one-way trip So his prospects take a terminal dip His assets frozen, the venue chosen Is the ends of the earth, whoopee! So long,"}
{"speaker": "IAGO", "text": "Good bye, see ya!"}
{"speaker": "JAFAR", "text": "Ex-Prince Ali! "}
{"speaker": "ALADDIN", "text": "Abu?  Abu!  (He looks back at a shivering pile of snow.)  Oh, this is all my fault--I should have freed the genie when I had the chance.  (He digs out ABU and cradles him inside his vest.)  Abu! Are you okay?  I'm sorry, Abu--I made a mess of everything, somehow.  I gotta go back and set things right.  (He starts to walk through the snow, and he eventuallysteps on a frozen CARPET.) Carpet!  (He looks up and sees CARPET is pinned by the pillar.  He tugs to try and free CARPET.  He can't do it, so he begins to remove snow from the base of the pillar.)   Abu, start digging!  That's it!  (Finally, enough snow has been removed, and the pillar begins to roll.  ALADDIN runs away, looks back, then slides into place.  The pillar rolls over him, and when it is gone, ALADDIN and ABU are left sitting in the patch of snow made by the window of the pillar.)  Yeah!  All right!  (He looks up at his turban, made out of scared ABU. CARPET shakes off the snow and rushes over to pick them up.)  Now, back to Agrabah!  Let's go! "}
{"speaker": "IAGO", "text": "Puppet ruler want a cracker? Here's your cracker. Shove 'em all right down your throat.  Here, have lots! "}
{"speaker": "JAFAR", "text": "Leave him alone! "}
{"speaker": "JAFAR", "text": "It pains me to see you reduced to this, Jasmine."}
{"speaker": "JASMINE", "text": "Never!"}
{"speaker": "JAFAR", "text": "I'll teach you some respect! (She falls back as he raises his hand to slap her.  Then he stops.)  No. Genie, I have decided to make my final wish.  I wish for Princess Jasmine to fall desperately in love with me. "}
{"speaker": "GENIE", "text": "(Again as Buckley) Ah, master-- there are a few addendas, some quid pro quo-"}
{"speaker": "JAFAR", "text": "Don't talk back to me, you stupid blue lout!  You will do what I order you to do, slave! "}
{"speaker": "JASMINE", "text": "(She stands and puts the crown on her head.) Jafar!  I never realized how incredibly handsome you are. "}
{"speaker": "JAFAR", "text": "That's better.  (He pulls the GENIE's jaw up like a shade.)  Now, pussycat, tell me more about...myself."}
{"speaker": "JASMINE", "text": "You're tall, well dressed... "}
{"speaker": "GENIE", "text": "Al!  Al, little buddy!"}
{"speaker": "ALADDIN", "text": "Shh!"}
{"speaker": "GENIE", "text": "(Literally zips his mouth shut, then unzips it.) Al, I can't help you--I work for senor psychopath, now.  (His head turns into JAFAR's, then back.)"}
{"speaker": "ALADDIN", "text": "Hey--I'm a street rat, remember? (He rezips GENIE's mouth.)  I'll improvise. "}
{"speaker": "JAFAR", "text": "Go on."}
{"speaker": "JASMINE", "text": "And your beard...is so...twisted!  (She has her arms around him.  She pretends to twist with her finger, but she is actually motioning for ALADDIN to come over.  He makes his move.  IAGO sees him.) "}
{"speaker": "IAGO", "text": "Jaf--mmmmmm! (ABU grabs him and covers his mouth.)"}
{"speaker": "JAFAR", "text": "And the street rat?"}
{"speaker": "JASMINE", "text": "What street rat? "}
{"speaker": "ABU", "text": "Yuck!"}
{"speaker": "JAFAR", "text": "That was--(he sees ALADDIN's reflection in her crown.) You!!  How many times do I have to kill you, boy? "}
{"speaker": "ALADDIN", "text": "Get the lamp! "}
{"speaker": "JAFAR", "text": "Ah, ah, ah, princess--Your time is up! "}
{"speaker": "ALADDIN", "text": "Jasmine!"}
{"speaker": "IAGO", "text": "Oh, nice shot, Jaf-- (he is knocked out by ABU.) "}
{"speaker": "JAFAR", "text": "Don't toy with me!  (He's zapped into a toy monkey."}
{"speaker": "ALADDIN", "text": "Abu!  "}
{"speaker": "JAFAR", "text": "Things are unraveling fast, now boy. (CARPET is zapped and unravels.  ALADDIN again rushes for the lamp.)  Get the point?  (His path is blocked by large swords sticking in the floor.  JAFAR grabs the lamp and laughs hideously. ALADDIN pulls a sword out of the floor.) I'm just getting warmed up!  (He breathes a ring of fire around ALADDIN.)"}
{"speaker": "ALADDIN", "text": "Are you afraid to fight me yourself, you cowardly snake?"}
{"speaker": "JAFAR", "text": "A snake, am I?  Perhaps you'd like to see how snake-like I can be!  (He smiles broadly, and we see a snake's tongue come out from behind his teeth.  He then turns into a giant cobra, and the ring of fire around ALADDIN becomes part of the snake encircling ALADDIN.  The snake JAFAR makes moves on ALADDIN, and on the third try, ALADDIN swings the sword and hits JAFAR.  Cut to GENIE cheerleaders wearing 'A' sweaters.) "}
{"speaker": "GENIE", "text": "Rickem, rockem, rackem, rake--stick that sword into that snake!"}
{"speaker": "JAFAR", "text": "You stay out of thissss! "}
{"speaker": "GENIE", "text": "(Weakly) Jafar, Jafar, he's our man--if he can't do it, GREAT! "}
{"speaker": "JASMINE", "text": "Aladdin! "}
{"speaker": "ALADDIN", "text": "Hang on, Jasmine! "}
{"speaker": "JAFAR", "text": "(laughs hideously)  You little fool!  You thought you could defeat the most powerful being on earth!"}
{"speaker": "IAGO", "text": "(with GENIE coming up behind him) Squeeze him, Jafar--Squeeze him like a--awk! (GENIE elbows him out of the way)"}
{"speaker": "JAFAR", "text": "Without the genie, boy, you're nothing!"}
{"speaker": "ALADDIN", "text": "(Has an idea)  The genie!  The genie!  The genie has more power than you'll ever have!"}
{"speaker": "JAFAR", "text": "What!!"}
{"speaker": "ALADDIN", "text": "He gave you your power, he can take it away!"}
{"speaker": "GENIE", "text": "Al, what are you doing?  Why are you bringing me into this?"}
{"speaker": "ALADDIN", "text": "Face it, Jafar--you're still just second best!"}
{"speaker": "JAFAR", "text": "You're right!  His power does exceed my own!  But not for long! "}
{"speaker": "GENIE", "text": "The boy is crazy.  He's a little punch drunk.  One too many hits with the snake  (His hand turns into a snake and he hits his head with it.)"}
{"speaker": "JAFAR", "text": "Slave, I make my third wish!  I wish to be an all powerful genie!"}
{"speaker": "GENIE", "text": "(Reluctantly) All right, your wish is my command. Way to go, Al. "}
{"speaker": "JAFAR", "text": "Yes!  Yes!  The power! The absolute power!"}
{"speaker": "JASMINE", "text": "(to ALADDIN) What have you done?"}
{"speaker": "ALADDIN", "text": "Trust me! "}
{"speaker": "JAFAR", "text": "The universe is mine to command, to control!"}
{"speaker": "ALADDIN", "text": "Not so fast, Jafar!  Aren't you forgetting something?"}
{"speaker": "JAFAR", "text": "No!  No!"}
{"speaker": "IAGO", "text": "I'm gettin' out of here!  Come on, you're the genie, I don't want-- "}
{"speaker": "ALADDIN", "text": "Phenomenal cosmic powers!  Itty bitty living space."}
{"speaker": "GENIE", "text": "Al, you little genius, you! "}
{"speaker": "JAFAR", "text": "(Both from inside the lamp.)  Get your blasted beak out of my face!"}
{"speaker": "IAGO", "text": "Oh, shut up, you moron!"}
{"speaker": "JAFAR", "text": "Don't tell me to shut up!"}
{"speaker": "GENIE", "text": "Allow me.  (He takes the lamp and goes to the balcony.  He is now wearing a baseball cap.  He winds up as if to throw the lamp, but opens his palm flat and flicks it out into the desert with his finger.) Ten- thousand years in a cave of wonders ought to chill him out! "}
{"speaker": "ALADDIN", "text": "Jasmine, I'm sorry I lied to you about being a prince."}
{"speaker": "JASMINE", "text": "I know why you did."}
{"speaker": "ALADDIN", "text": "Well, I guess...this... is goodbye?  (GENIE pokes his head around the corner shocked at what he is hearing.)"}
{"speaker": "JASMINE", "text": "Oh, that stupid law.  This isn't fair--I love you."}
{"speaker": "GENIE", "text": "(Wipes away a tear)  Al, no problem. You've still got one wish left.  Just say the word and you're a prince again."}
{"speaker": "ALADDIN", "text": "But Genie, what about your freedom?"}
{"speaker": "GENIE", "text": "Hey, it's only an eternity of servitude.  This is love.  (He leans down next to her.)  Al, you're not gonna find another girl like her in a million years.  Believe me, I know.  I've looked."}
{"speaker": "ALADDIN", "text": "Jasmine, I do love you, but I've got to stop pretending to be something I'm not."}
{"speaker": "JASMINE", "text": "I understand. "}
{"speaker": "ALADDIN", "text": "Genie, I wish for your freedom."}
{"speaker": "GENIE", "text": "One bona fide prince pedigree coming up.  I--what?"}
{"speaker": "ALADDIN", "text": "(He holds the lamp up to GENIE.)  Genie, you're free! "}
{"speaker": "GENIE", "text": "(He can't believe it.)  Heh, heh!  I'm free. I'm free.  (He hands the lamp to ALADDIN.)  Quick, quick, wish for something outrageous.  Say  \"I want the Nile.\"   Wish for the Nile.  Try that!"}
{"speaker": "ALADDIN", "text": "I wish for the Nile."}
{"speaker": "GENIE", "text": "No way!!  (Laughs hysterically.  He bounces around the balcony like a pinball.)  Oh does that feel good!  I'm free!  I'm free at last!  I'm hittin' the road.  I'm off to see the world!  I-- "}
{"speaker": "ALADDIN", "text": "Genie, I'm--I'm gonna miss you."}
{"speaker": "GENIE", "text": "Me too, Al.  No matter what anybody says, you'll always be a prince to me. "}
{"speaker": "SULTAN", "text": "That's right.  You've certainly proven your worth as far as I'm concerned. It's that law that's the problem."}
{"speaker": "JASMINE", "text": "Father?"}
{"speaker": "SULTAN", "text": "Well, am I sultan or am I sultan?  From this day forth, the princess shall marry whomever she deems worthy."}
{"speaker": "JASMINE", "text": "(She smiles widely and runs into ALADDIN's arms.) Him!  I choose...I choose you, Aladdin."}
{"speaker": "ALADDIN", "text": "Ha, ha.  Call me Al. "}
{"speaker": "GENIE", "text": "Oh, all of ya. Come over here.  Big group hug! Mind if I kiss the monkey?  (He kisses ABU.)  Ooh, hairball!  Well, I can't do any more damage around this popsicle stand.  I'm outta here!  Bye, bye, you two crazy lovebirds.  Hey, Rugman: ciao!  I'm history!   No, I'm mythology!  No, I don't care what I am--I'm free! "}
{"speaker": "ALADDIN", "text": "A whole new world"}
{"speaker": "JASMINE", "text": "A whole new life"}
{"speaker": "BOTH", "text": "(with off-camera chorus)    For you and me! MEN'S CHORUS:   A whole new world! "}
{"speaker": "GENIE", "text": "Made ya look! "}
